tap "opencoworkai/tap"
# Zsh 主题仓库
tap "romkatv/powerlevel10k"
tap "sunnyyoung/tap"
# 带语法高亮的 cat 替代品
brew "bat"
brew "cc-connect"
# 内嵌在 nvim 中的 代码对比工具:逻辑差异深度审查
brew "difftastic"
# 自动加载项目级环境变量
brew "direnv"
# 带图标的 ls 现代化替代品
brew "eza"
# 实现terminal启动的欢迎展示
brew "fastfetch"
# 模糊搜索辅助 Tmux 的sessionx 插件
brew "fzf"
# Google Gemini 终端助手
brew "gemini-cli"
brew "gh"
brew "git-delta"
# Go 编程语言
brew "go"
# JSON预览 辅助 Yazi
brew "jq"
# Docker 交互式终端界面
brew "lazydocker"
# Git 交互式终端界面
brew "lazygit"
# ssh输入预测
brew "mosh"
# 主编辑器
brew "neovim"
# Node.js 包管理器
brew "pnpm"
# PDF预览 辅助 Yazi
brew "poppler"
# 极速 Zsh 主题
brew "powerlevel10k"
brew "python@3.13"
# 高速搜索，neovim grep 依赖
brew "ripgrep"
brew "rust"
# 实现config文件的统一管理
brew "stow"
brew "tmux"
# tmux session/layout manager for project workspaces
brew "tmuxinator"
# Python 包与项目管理器
brew "uv"
brew "wireguard-tools"
# 基于 Rust 的终端文件管理器
brew "yazi"
# 智能 cd 跳转工具
brew "zoxide"
# 现代化 Shell 解释器
brew "zsh"
# 自动补全建议插件
brew "zsh-autosuggestions"
# 语法高亮插件
brew "zsh-syntax-highlighting"
# 微信多开工具
brew "sunnyyoung/tap/wechattweak"
cask "apifox"
# 用于在cli中大模型切换使用
cask "cc-switch"
# Anthropic 命令行 AI 助手
cask "claude-code"
# 临时使用数据库
cask "datagrip"
# 钉钉办公客户端
cask "dingtalk"
# 编程图标补丁字体
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
# 实现豆包的语音输入接入
cask "hammerspoon"
# 压缩与解压缩工具
cask "keka"
# 知识管理与 Markdown 笔记
cask "obsidian"
# 轻量级容器与虚拟机管理
cask "orbstack"
# 截图/贴图/OCR 效率工具
cask "pixpin"
# 纸飞机
cask "telegram"
npm "lawliet-code"
